*~p9t24fkd0g2w1z1x6l10;
*=======================================================================*  && 1
*   猜  數  字  遊  戲      ？ Ａ  ？ Ｂ                    by  J.W.L   *  && 2
*=======================================================================*  && 3
set talk off                                                               && 4
set echo off                                                               && 5
store space(3) to 答案, 我猜                                               && 6
store space(1) to 答1, 答2, 答3, 猜1, 猜2, 猜3                             && 7
store 0 to A, B, 亂數                                                      && 8
store 0 to 次數                                                            && 9
store .F. to 合法, 全對, 超次                                              &&10
store space(20) to 結論                                                    &&11
clear                                                                      &&12
*                                                                          &&13
do while .not. 合法                                                        &&14
  亂數 = val(substr(time(),4,2)) * val(substr(time(),7,2))                 &&15
  答案 = ltrim(str(mod(亂數,1000)))                                        &&16
  if len(答案) = 3                                                         &&17
    答1 = substr(答案,1,1)                                                 &&18
    答2 = substr(答案,2,1)                                                 &&19
    答3 = substr(答案,3,1)                                                 &&20
    合法 = 答1 <> 答2 .and. 答1 <> 答3 .and. 答2 <> 答3                    &&21
  endif                                                                    &&22
enddo                                                                      &&23
*                                                                          &&24
@2,24 say '請 輸 入 您 猜 的 答 案 .....'                                  &&25
do while .not.(全對 .or. 超次)                                             &&26
  合法 = .F.                                                               &&27
  次數 = 次數 + 1                                                          &&28
  do while .not. 合法                                                      &&29
    store space(3) to 我猜                                                 &&30
    @ 3 + 次數, 20 say '(' + ltrim(str(次數)) + ')' get 我猜 picture '999' &&31
    read                                                                   &&32
    @ 3 + 次數, 20 say '(' + ltrim(str(次數)) + ') ' + 我猜                &&33
    猜1 = substr(我猜,1,1)                                                 &&34
    猜2 = substr(我猜,2,1)                                                 &&35
    猜3 = substr(我猜,3,1)                                                 &&36
    合法 = 猜1 <> 猜2 .and. 猜1 <> 猜3 .and. 猜2 <> 猜3 .and. 猜1 <> '0'   &&37
  enddo                                                                    &&38
  A = iif(答1 = 猜1,1,0) + iif(答2 = 猜2,1,0) + iif(答3 = 猜3,1,0)         &&39
  B = iif(答1 $ 猜2+猜3,1,0)+iif(答2 $ 猜1+猜3,1,0)+iif(答3 $ 猜1+猜2,1,0) &&40
  @ 3 + 次數, 30 say str(A) + ' A' + str(B) + ' B'                         &&41
  全對 = A = 3                                                             &&42
  超次 = 次數 > 16                                                         &&43
enddo                                                                      &&44
*                                                                          &&45
do case                                                                    &&46
  case 次數 = 1                                                            &&47
    結論 = '你 也 是 電 腦 嗎 ?'                                           &&48
  case 次數 < 7                                                            &&49
    結論 = '嗯,數 學 天 才 哦 !'                                           &&50
  case 次數 < 11                                                           &&51
    結論 = '再 玩 一 次 吧 !'                                              &&52
  case 次數 < 17                                                           &&53
    結論 = '你 終 於 矇 對 了 !'                                           &&54
  otherwise                                                                &&55
    結論 = '啍!不 讓 你 玩 了 !'                                           &&56
endcase                                                                    &&57
@ 21, 30 say 結論                                                          &&58
close all                                                                  &&59
cancel                                                                     &&60













