clear
@ 3,12 say "※※※※※※※※※※※※※※※※※※※※※※※※※※※※※"
@ 4,12 say "※                                                      ※"
@ 5,12 say "※    進  銷  月  報  表        列  印  程  式          ※"
@ 6,12 say "※                                                      ※"
@ 7,12 say "※                                                J.W.L ※"
@ 8,12 say "※※※※※※※※※※※※※※※※※※※※※※※※※※※※※"
set echo off
set talk off
close all
*
store month(date()) to 月分
store 35 to 每頁項數
store 1	to 頁數
store space(2) to 月
select A
use FULIE index	FULIE
*
@ 13,16	say "欲 列 印 何 月 分 之 進 銷 存 月 報 表 ? ..... " get 月分 picture "99" range 1,12
@ 17,26	say "請 輸 入 每 頁 項 數 ....." get  每頁項數 picture "99" range 1,50
@ 21,20	say "以 下 將 列 出 資 料 不 合 理 者 !! ....."
read
月 = ltrim(str(月分))
select B
use IO&月 index	IO&月
*
display	all for	本銷價*本銷數+本存價*本存數-上存價*上存數-本進價*本進數	< 0
wait
go top
*
store 000.00 to	上存金額,本進金額,本銷金額,本存金額,差價金額
store 00000.00 to 上存總計,本進總計,本銷總計,本存總計,差價總計
總頁數 = int(reccount()/每頁項數)
總頁數 = iif(mod(reccount(),每頁項數)=0,總頁數,總頁數 +	1)
*
do while .not. eof()
  clear
  store	space(1) to 顯示
  store	00000.00 to 上存合計,本進合計,本銷合計,本存合計,差價合計
  @ 9,18 say "共 " + transform(總頁數,"##") + " 頁 ，現 在 是 第 " + transform(頁數,"##") + " 頁"
  @ 12,18 say "若 印 表 機 已 備 妥 ，按 Ｐ 鍵 開 始 列 印 ......"
  @ 14,18 say "按 Ｓ 鍵 則 只 顯 示 於 螢 幕 上 ......"
  @ 16,18 say "按 Ｑ 鍵 則 結 束 本 程 式 ......"
  @ 18,18 say "按 其 他 任 一 鍵 則 跳 過 此 頁 !" get 顯示 picture "X"
  read
  顯示 = upper(顯示)
  if 顯示 = "Q"
    close all
    cancel
  endif
  if 顯示 = "P"
    set	print on
  endif
  if 顯示 = "S"	.or. 顯示 = "P"
    ?? chr(126)	+ "p9d0w2z2x10l6;"
    ?"     國軍營區福利站年度" + 月 + "月福利品進銷存月報表"
    ?? chr(126)	+ "w1z1x20l5;"
    ?space(36),"中華民國" + dtoz(date())
    ??space(10),"共" + transform(總頁數,"##") +	"頁"
    ??"  第" + transform(頁數,"##") + "頁"
    ?? chr(126)	+ "g2x0l0"
    ?"╔══╤════╤════════════╤═╦═══════════╦═══════════╦═══════════╦═══════════╦════╗"
    ?"║    │        │                        │單║  上   月    存   貨  ║  本   月    進   貨  ║  本   月    銷   貨  ║  本   月    存   貨  ║ 進銷貨 ║"
    ?"║編號│廠商名稱│   品  名  及  規  格   │  ╟──┬───┬────╫──┬───┬────╫──┬───┬────╫──┬───┬────╢        ║"
    ?"║    │        │                        │位║數量│ 單價 │ 金  額 ║數量│ 單價 │ 金  額 ║數量│ 單價 │ 金  額 ║數量│ 單價 │ 金  額 ║ 差  價 ║"
    ?"╟──┼────┼────────────┼─╫──┼───┼────╫──┼───┼────╫──┼───┼────╫──┼───┼────╫────╢"
    ?? chr(126)	+ "l4"
  endif
  *
  store	1 to 編號
  store	.F. to 頁末
  do ioprints
  *
  上存總計 = 上存總計 +	上存合計
  本進總計 = 本進總計 +	本進合計
  本銷總計 = 本銷總計 +	本銷合計
  本存總計 = 本存總計 +	本存合計
  差價總計 = 差價總計 +	差價合計
  *
  if 顯示 = "S"	.or. 顯示 = "P"
    ? "║           本      頁      合      計       "
    ??"║" + transform(上存合計,"###################.##")
    ??"║" + transform(本進合計,"###################.##")
    ??"║" + transform(本銷合計,"###################.##")
    ??"║" + transform(本存合計,"###################.##")
    ??"║" + transform(差價合計,"#####.##") + "║"
    *
    if 頁數 = 總頁數
      ?	"╠══════════════════════╬═══════════╬═══════════╬═══════════╬═══════════╬════╣"
      ?	"║           總                      計       "
      ??"║" + transform(上存總計,"###################.##")
      ??"║" + transform(本進總計,"###################.##")
      ??"║" + transform(本銷總計,"###################.##")
      ??"║" + transform(本存總計,"###################.##")
      ??"║" + transform(差價總計,"#####.##") +	"║"
    endif
    *
    ? "╚══════════════════════╩═══════════╩═══════════╩═══════════╩═══════════╩════╝"
    ?
    ?"        站  主  任",space(40),"複    核",space(40),"製    表"
    ?
  endif
  頁數 = 頁數 +	1
  set print off
enddo
close all
cancel

